movie-catalog/app/views/directors/_form.html.erb


    <%= f.collection_select :genre, Genre.all, :id, :name %>
---
SELECT "genres".* FROM "genres"