cookbook/app/views/recipes/_form.html.erb

    <%= f.label :cuisine_id %>
    <%= f.collection_select :cuisine_id, Cuisine.all, :id, :name %>
    <%= f.label :recipe_type_id %>
    <%= f.collection_select :recipe_type_id, RecipeType.all, :id, :name %>
---
SELECT "cuisines".* FROM "cuisines"
SELECT "recipe_types".* FROM "recipe_types"