movie-catalog/app/controllers/directors_controller.rb

  def show
    @director = Director.find(params[:id])
    @movies = Movie.where(director_id: @director.id)
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = ?  [["director_id", 13]]

  def create
    items = params[:director]
    @director = Director.new(name: items[:name], born_in: items[:born_in], nationality: items[:nationality], genre_id: items[:genre])

    if @director.save
---
INSERT INTO "directors" ("name", "nationality", "born_in", "created_at", "updated_at", "genre_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "123"], ["nationality", "123"], ["born_in", "2024-02-26"], ["created_at", "2024-03-30 13:45:13.466152"], ["updated_at", "2024-03-30 13:45:13.466152"], ["genre_id", 5]]

  def edit
    @director = Director.find(params[:id])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    items = params[:director]
    @director = Director.find(params[:id])
    @director.update(name: items[:name], born_in: items[:born_in], nationality: items[:nationality], genre_id: items[:genre])
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "directors" SET "name" = ?, "updated_at" = ?, "genre_id" = ? WHERE "directors"."id" = ?  [["name", "a"], ["updated_at", "2024-03-29 13:58:23.660266"], ["genre_id", 2], ["id", 6]]

  def destroy
    director = Director.find(params[:id])
    director.destroy
---
SELECT "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "directors" WHERE "directors"."id" = ?  [["id", 13]]