movie-catalog/app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = ? LIMIT ?  [["genre_id", 3], ["LIMIT", 1]]
---
    def show
        @genre = Genre.find(params[:id])
        @movies = Movie.where(genre_id: @genre.id)

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "123"], ["created_at", "2024-03-30 13:45:07.501622"], ["updated_at", "2024-03-30 13:45:07.501622"]]
---
    def create
        @genre = Genre.new(name: params[:genre][:name])

        if @genre.save

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "aaa"], ["updated_at", "2024-03-30 13:47:52.762760"], ["id", 5]]
---
    def update
        genre = Genre.find(params[:id])
        if genre.update(name: params[:genre][:name])

SELECT "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 3]]
---
    def destroy
        genre = Genre.find(params[:id])
        genre.destroy