movie-catalog/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "release_date", "synopsis", "duration", "director_id", "genre_id", "created_at", "updated_at", "released") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        items = params[:movie]
        @movie = Movie.new(title: items[:title], release_date: items[:release_date], synopsis: items[:synopsis], duration: items[:duration], director_id: items[:director_id], genre_id: items[:genre_id])

        if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "synopsis" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["synopsis", "eu caguei."], ["updated_at", "2024-03-30 11:49:24.419030"], ["id", 1]]
UPDATE "movies" SET "updated_at" = ?, "released" = ?, "status" = ? WHERE "movies"."id" = ?  [["updated_at", "2024-03-30 15:22:26.839993"], ["released", 0], ["status", 2], ["id", 22]]
---
    def update
        items = params[:movie]
        @movie = Movie.find(params[:id])
        @movie.update(title: items[:title], release_date: items[:release_date], synopsis: items[:synopsis], duration: items[:duration], director_id: items[:director_id], genre_id: items[:genre_id])

        if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]
---
    def destroy
        movie = Movie.find(params[:id])
        if movie.destroy