cookbook/app/controllers/cuisines_controller.rb

    def create
        @cuisine = Cuisine.new(name: params[:cuisine][:name])

        if @cuisine.save
---
INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "{\"name\"=>\"123123\"}"], ["created_at", "2024-03-28 18:50:20.647314"], ["updated_at", "2024-03-28 18:50:20.647314"]]