cookbook/app/controllers/recipe_types_controller.rb

    def create
        @recipe_type = RecipeType.new(params.require(:recipe_type).permit(:name))

        if @recipe_type.save
---
INSERT INTO "recipe_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "janta"], ["created_at", "2024-03-28 18:32:55.032775"], ["updated_at", "2024-03-28 18:32:55.032775"]]