cookbook/app/controllers/recipes_controller.rb

    def create
        items = params[:recipe]
        @recipe = Recipe.new(name: items[:name], description: items[:description], cuisine_id: items[:cuisine_id], recipe_type_id: items[:recipe_type_id] , preparation_method: items[:preparation_method], preparation_time: items[:preparation_time], status: :draft)
        if @recipe.save
---
INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "preparation_method", "preparation_time", "recipe_type_id", "cuisine_id", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def update
        @recipe = Recipe.find(params[:id])
        items = params[:recipe]

        if @recipe.update(name: items[:name], description: items[:description], cuisine_id: items[:cuisine_id], recipe_type_id: items[:recipe_type_id] , preparation_method: items[:preparation_method], preparation_time: items[:preparation_time], status: :draft)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = ?, "updated_at" = ?, "recipe_type_id" = ?, "cuisine_id" = ? WHERE "recipes"."id" = ?  [["name", "joao"], ["updated_at", "2024-03-28 23:33:05.937464"], ["recipe_type_id", 1], ["cuisine_id", 4], ["id", 6]]

    def publish
        recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def unpublish
        recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]