movie-catalog/app/views/movies/new.html.erb

        <%= f.label :director_id %><br>
        <%= f.collection_select :director_id, Director.order(:name), :id, :name %>
---
SELECT "directors".* FROM "directors" ORDER BY "directors"."name" ASC

        <%= f.label :genre_id %><br>
        <%= f.collection_select :genre_id, Genre.order(:name), :id, :name %>
---
SELECT "genres".* FROM "genres" ORDER BY "genres"."name" ASC